Core/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>ЗагружаетсяИзИнтернета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыПрописиНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СимвольноеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаКурса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиКурса</name>
    <type>
      <types>EnumRef.СпособыУстановкиКурсаВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыПрописиНаГрузинском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыПрописиНаАнглиском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/InformationRegisters/СинонимиВалют/СинонимиВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СинонимиВалют</name>
  <resources>
    <name>РусПолеПрописиЦел1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиЦел2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиЦел3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиДроб1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиДроб2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РусПолеПрописиДроб3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрузПолеПрописиЦел1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрузПолеПрописиДроб1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АнглПолеПрописиЦел1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АнглПолеПрописиЦел2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АнглПолеПрописиДроб1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АнглПолеПрописиДроб2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлинаДробнойЧасти</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СпособыУстановкиКурсаВалюты/СпособыУстановкиКурсаВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыУстановкиКурсаВалюты</name>
  <enumValues>
    <name>ЗагрузкаИзИнтернета</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
  <enumValues>
    <name>НаценкаНаКурсДругойВалюты</name>
  </enumValues>
  <enumValues>
    <name>РасчетПоФормуле</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/Валюты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Параметры.Свойство("КодВалюты") Тогда
			Объект.Код = Параметры.КодВалюты;
		КонецЕсли;
		
		Если Параметры.Свойство("НаименованиеКраткое") Тогда
			Объект.Наименование = Параметры.НаименованиеКраткое;
		КонецЕсли;
		
		Если Параметры.Свойство("НаименованиеПолное") Тогда
			Объект.НаименованиеПолное = Параметры.НаименованиеПолное;
		КонецЕсли;
		
		Если Параметры.Свойство("Загружается") И Параметры.Загружается Тогда
			Объект.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета;
		Иначе 
			Объект.СпособУстановкиКурса = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
		КонецЕсли;
		
		Если Параметры.Свойство("ПараметрыПрописиНаРусском") Тогда
			Объект.ПараметрыПрописиНаРусском = Параметры.ПараметрыПрописиНаРусском;
		КонецЕсли;
		
		ЗаполнитьФормуПоОбъекту();
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьФормуПоОбъекту();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыПрописи  = ПолучитьВсеСиноними(ТекущийОбъект.Ссылка);
	
	Если Не ПараметрыПрописи = Неопределено Тогда 
		ТекущийОбъект.ПараметрыПрописиНаРусском = ПараметрыПрописи.Рус;
		ТекущийОбъект.ПараметрыПрописиНаГрузинском = ПараметрыПрописи.Груз;
		ТекущийОбъект.ПараметрыПрописиНаАнглиском = ПараметрыПрописи.Англ; 
	КонецЕсли;
	
	
	
	НаборЗаписей = РегистрыСведений.СинонимиВалют.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Валюта.Установить(ТекущийОбъект.Ссылка);
	//НаборЗаписей.Прочитать();
	
	НоваяЗапись = НаборЗаписей.Добавить();
	//Регистр = РегистрыСведений.СинонимиВалют.СоздатьМенеджерЗаписи();
	НоваяЗапись.Валюта = ТекущийОбъект.Ссылка;
	НоваяЗапись.РусПолеПрописиЦел1 = ЭтотОбъект.ПолеПрописи1наРусском;
	НоваяЗапись.РусПолеПрописиЦел2 = ЭтотОбъект.ПолеПрописи2наРусском;
	НоваяЗапись.РусПолеПрописиЦел3 = ЭтотОбъект.ПолеПрописи3наРусском;
	НоваяЗапись.РусПолеПрописиДроб1 = ЭтотОбъект.ПолеПрописи5наРусском;
	НоваяЗапись.РусПолеПрописиДроб2 = ЭтотОбъект.ПолеПрописи6наРусском;
	НоваяЗапись.РусПолеПрописиДроб3 = ЭтотОбъект.ПолеПрописи7наРусском;
	НоваяЗапись.ДлинаДробнойЧасти = ЭтотОбъект.ДлинаДробнойЧасти;
	
	ЗаполнитьВсесиноними(ТекущийОбъект.Ссылка,НоваяЗапись);
	//УстановитьПривилегированныйРежим(Истина);
	Попытка
		НаборЗаписей.Записать(Истина);
	Исключение
		Сообщить(ИнформацияОбОшибке());
	КонецПопытки;
	
	
КонецПроцедуры

#КонецОбласти

//+++Rajak

Процедура  ЗаполнитьВсесиноними(Валюта, НаборЗаписей)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинонимиВалют.ГрузПолеПрописиЦел1,
	|	СинонимиВалют.ГрузПолеПрописиДроб1,
	|	СинонимиВалют.АнглПолеПрописиЦел1,
	|	СинонимиВалют.АнглПолеПрописиЦел2,
	|	СинонимиВалют.АнглПолеПрописиДроб1,
	|	СинонимиВалют.АнглПолеПрописиДроб2
	|ИЗ
	|	РегистрСведений.СинонимиВалют КАК СинонимиВалют
	|ГДЕ
	|	СинонимиВалют.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ЗаполнитьЗначенияСвойств(НаборЗаписей,ВыборкаДетальныеЗаписи);
		
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьВсеСиноними(Валюта)
	
	Перем СинонимиВалют;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СинонимиВалют.РусПолеПрописиЦел1,
	|	СинонимиВалют.РусПолеПрописиЦел2,
	|	СинонимиВалют.РусПолеПрописиЦел3,
	|	СинонимиВалют.РусПолеПрописиДроб1,
	|	СинонимиВалют.РусПолеПрописиДроб2,
	|	СинонимиВалют.РусПолеПрописиДроб3,
	|	СинонимиВалют.ГрузПолеПрописиЦел1,
	|	СинонимиВалют.ГрузПолеПрописиДроб1,
	|	СинонимиВалют.АнглПолеПрописиЦел1,
	|	СинонимиВалют.АнглПолеПрописиЦел2,
	|	СинонимиВалют.АнглПолеПрописиДроб1,
	|	СинонимиВалют.АнглПолеПрописиДроб2,
	|	СинонимиВалют.ДлинаДробнойЧасти
	|ИЗ
	|	РегистрСведений.СинонимиВалют КАК СинонимиВалют
	|ГДЕ
	|	СинонимиВалют.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		
		СинонимиВалют = Неопределено;
		
	Иначе 	
		
		СинонимиВалют = Новый Структура;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ФорматРус = ВыборкаДетальныеЗаписи.РусПолеПрописиЦел1 +", "
			+ ВыборкаДетальныеЗаписи.РусПолеПрописиЦел2 +", " 
			+ ВыборкаДетальныеЗаписи.РусПолеПрописиЦел3 +", "
			+" ,"
			+ ВыборкаДетальныеЗаписи.РусПолеПрописиДроб1 +", "
			+ ВыборкаДетальныеЗаписи.РусПолеПрописиДроб2 +", "
			+ ВыборкаДетальныеЗаписи.РусПолеПрописиДроб3 +", "
			+" ,";
			//+ ВыборкаДетальныеЗаписи.ДлинаДробнойЧасти;
			
			ФорматГруз = ВыборкаДетальныеЗаписи.ГрузПолеПрописиЦел1 +", " 
			+ ВыборкаДетальныеЗаписи.ГрузПолеПрописиДроб1 +", ";
			
			//+ ВыборкаДетальныеЗаписи.ДлинаДробнойЧасти;
			
			ФорматАнгл = ВыборкаДетальныеЗаписи.АнглПолеПрописиЦел1 +", "
			+ ВыборкаДетальныеЗаписи.АнглПолеПрописиЦел2 +", " 
			+ ВыборкаДетальныеЗаписи.АнглПолеПрописиДроб1 +", "
			+ ВыборкаДетальныеЗаписи.АнглПолеПрописиДроб2 +", ";
			//+ ВыборкаДетальныеЗаписи.ДлинаДробнойЧасти;
			
			СинонимиВалют.Вставить("Рус",ФорматРус);
			СинонимиВалют.Вставить("Груз",ФорматГруз);
			СинонимиВалют.Вставить("Англ",ФорматАнгл);
			
		КонецЦикла;
	КонецЕсли;	
	Возврат СинонимиВалют;	

КонецФункции
//+++Rajak

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// Страница "Основные сведения".

&НаКлиенте
Процедура ОсновнаяВалютаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПодготовитьДанныеВыбораПодчиненнойВалюты(ДанныеВыбора, Объект.Ссылка);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Страница "Параметры прописи валюты".

&НаКлиенте
Процедура СуммаЧислоПриИзменении(Элемент)
	
	УстановитьСуммуПрописью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи4наРусскомПриИзменении(Элемент)
	УстановитьСклоненияПараметровПрописи(ЭтотОбъект);
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи4наРусскомАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = АвтоПодборПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи4наРусскомОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ОкончаниеВводаТекстаПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи8наРусскомПриИзменении(Элемент)
	УстановитьСклоненияПараметровПрописи(ЭтотОбъект);
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи8наРусскомАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = АвтоПодборПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи8наРусскомОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ОкончаниеВводаТекстаПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи1наРусскомПриИзменении(Элемент)
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи2наРусскомПриИзменении(Элемент)
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи3наРусскомПриИзменении(Элемент)
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи5наРусскомПриИзменении(Элемент)
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи6наРусскомПриИзменении(Элемент)
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПолеПрописи7наРусскомПриИзменении(Элемент)
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДлинаДробнойЧастиПриИзменении(Элемент)
	УстановитьСуммуПрописью(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ДлинаДробнойЧастиАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	ДанныеВыбора = АвтоПодборПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДлинаДробнойЧастиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ДанныеВыбора = ОкончаниеВводаТекстаПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсВалютыПриИзменении(Элемент)
	УстановитьДоступностьЭлементов(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФормуПоОбъекту()
	
	ПрочитатьПараметрыПрописи();
	
	УстановитьСклоненияПараметровПрописи(ЭтотОбъект);
	УстановитьСуммуПрописью(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрыПрописиНаРусском(Форма)
	
	Возврат Форма.ПолеПрописи1наРусском + ", "
			+ Форма.ПолеПрописи2наРусском + ", "
			+ Форма.ПолеПрописи3наРусском + ", "
			+ НРег(Лев(Форма.ПолеПрописи4наРусском, 1)) + ", "
			+ Форма.ПолеПрописи5наРусском + ", "
			+ Форма.ПолеПрописи6наРусском + ", "
			+ Форма.ПолеПрописи7наРусском + ", "
			+ НРег(Лев(Форма.ПолеПрописи8наРусском, 1)) + ", "
			+ Форма.ДлинаДробнойЧасти;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСуммуПрописью(Форма)
	
	Форма.СуммаПрописью = ЧислоПрописью(Форма.СуммаЧисло, , ПараметрыПрописиНаРусском(Форма));
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПараметрыПрописи()
	
	СтрокаПараметров = СтрЗаменить(Объект.ПараметрыПрописиНаРусском, ",", Символы.ПС);
	
	ПолеПрописи1наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 1));
	ПолеПрописи2наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 2));
	ПолеПрописи3наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 3));
	
	//Род = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 4));
	//
	//Если	  НРег(Род) = "м" Тогда
	//	ПолеПрописи4наРусском = "Мужской";
	//ИначеЕсли НРег(Род) = "ж" Тогда
	//	ПолеПрописи4наРусском = "Женский";
	//ИначеЕсли НРег(Род) = "с" Тогда
	//	ПолеПрописи4наРусском = "Средний";
	//КонецЕсли;
	
	ПолеПрописи5наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 5));
	ПолеПрописи6наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 6));
	ПолеПрописи7наРусском = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 7));
	
	Род = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 8));
	
	//Если	  НРег(Род = "м") Тогда
	//	ПолеПрописи8наРусском = "Мужской";
	//ИначеЕсли НРег(Род = "ж") Тогда
	//	ПолеПрописи8наРусском = "Женский";
	//ИначеЕсли НРег(Род = "с") Тогда
	//	ПолеПрописи8наРусском = "Средний";
	//КонецЕсли;
	
	ДлинаДробнойЧасти     = СокрЛП(СтрПолучитьСтроку(СтрокаПараметров, 9));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСклоненияПараметровПрописи(Форма)
	
	// Склонение заголовков параметров прописи.
	
	Элементы = Форма.Элементы;
	
	Если Форма.ПолеПрописи4наРусском = "Женский" Тогда
		Элементы.ПолеПрописи1наРусском.Заголовок = НСтр("ka='ერთი';ru='Одна';en='one'");
		Элементы.ПолеПрописи2наРусском.Заголовок = НСтр("ka='ორი';ru='Две';en='two'");
	ИначеЕсли Форма.ПолеПрописи4наРусском = "Мужской" Тогда
		Элементы.ПолеПрописи1наРусском.Заголовок = НСтр("ka='ერთი';ru='Один';en='One'");
		Элементы.ПолеПрописи2наРусском.Заголовок = НСтр("ka='ორი';ru='Два';en='Two'");
	Иначе
		Элементы.ПолеПрописи1наРусском.Заголовок = НСтр("ka='ერთი';ru='Одно';en='one'");
		Элементы.ПолеПрописи2наРусском.Заголовок = НСтр("ka='ორი';ru='Два';en='Two'");
	КонецЕсли;
	
	Если Форма.ПолеПрописи8наРусском = "Женский" Тогда
		Элементы.ПолеПрописи5наРусском.Заголовок = НСтр("ka='ერთი';ru='Одна';en='one'");
		Элементы.ПолеПрописи6наРусском.Заголовок = НСтр("ka='ორი';ru='Две';en='two'");
	ИначеЕсли Форма.ПолеПрописи8наРусском = "Мужской" Тогда
		Элементы.ПолеПрописи5наРусском.Заголовок = НСтр("ka='ერთი';ru='Один';en='One'");
		Элементы.ПолеПрописи6наРусском.Заголовок = НСтр("ka='ორი';ru='Два';en='Two'");
	Иначе
		Элементы.ПолеПрописи5наРусском.Заголовок = НСтр("ka='ერთი';ru='Одно';en='one'");
		Элементы.ПолеПрописи6наРусском.Заголовок = НСтр("ka='ორი';ru='Два';en='Two'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПодготовитьДанныеВыбораПодчиненнойВалюты(ДанныеВыбора, Ссылка)
	
	// Подготавливает список выбора для подчиненной валюты таким образом,
	// чтобы в список не попала сама подчиненная валюта.
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ Ссылка, НаименованиеПолное
	               |ИЗ
	               |	Справочник.Валюты
	               |ГДЕ
	               |	Ссылка <> &Ссылка
	               |И
	               |	ОсновнаяВалюта  = Значение(Справочник.Валюты.ПустаяСсылка)
	               |УПОРЯДОЧИТЬ ПО НаименованиеПолное";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.НаименованиеПолное);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция АвтоПодборПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка)
	
	// Вспомогательная функция управлением вводом.
	
	Для Каждого ЭлементВыбора Из Элемент.СписокВыбора Цикл
		Если ВРег(Текст) = ВРег(Лев(ЭлементВыбора.Представление, СтрДлина(Текст))) Тогда
			Результат = Новый СписокЗначений;
			Результат.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			СтандартнаяОбработка = Ложь;
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ОкончаниеВводаТекстаПоСпискуВыбора(Элемент, Текст, СтандартнаяОбработка)
	
	// Вспомогательная функция управлением вводом.
	
	СтандартнаяОбработка = Ложь;
	
	Для Каждого ЭлементВыбора Из Элемент.СписокВыбора Цикл
		Если ВРег(Текст) = ВРег(ЭлементВыбора.Представление) Тогда
			СтандартнаяОбработка = Истина;
		ИначеЕсли ВРег(Текст) = ВРег(Лев(ЭлементВыбора.Представление, СтрДлина(Текст))) Тогда
			СтандартнаяОбработка = Ложь;
			Результат = Новый СписокЗначений;
			Результат.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Форма)
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	Элементы.ГруппаНаценкаНаКурсДругойВалюты.Доступность = Объект.СпособУстановкиКурса = ПредопределенноеЗначение("Перечисление.СпособыУстановкиКурсаВалюты.НаценкаНаКурсДругойВалюты");
	Элементы.ФормулаРасчетаКурса.Доступность = Объект.СпособУстановкиКурса = ПредопределенноеЗначение("Перечисление.СпособыУстановкиКурсаВалюты.РасчетПоФормуле");      
	Объект.ЗагружаетсяИзИнтернета = Объект.СпособУстановкиКурса = ПредопределенноеЗначение("Перечисление.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета");
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	РС_ОбщегоНазначенияКлиент.ПроверкаМодифицированостиВопрос(Объект.Ссылка, Модифицированность, Отказ);//Паганини
КонецПроцедуры
#КонецОбласти
